tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "tinygo-org/tools"

brew "autojump"
brew "bat"
brew "bun"
brew "chafa"
brew "colima"
brew "curl"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "git-delta"
brew "git-flow"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "hugo"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "lua"
brew "neovim"
brew "nexttrace"
brew "onefetch"
brew "openssh"
brew "openssl@3"
brew "pandoc"
brew "pinentry"
brew "pinentry-mac"
brew "pnpm"
brew "protobuf@3"
brew "ripgrep"
brew "sqlite"
brew "telnet"
brew "the_silver_searcher"
brew "tinygo"
brew "tmux"
brew "trash-cli"
brew "tree-sitter"
brew "vim"
brew "wget"
brew "yadm"

cask "alacritty"
cask "cyberduck"
cask "eudic"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "fork"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "microsoft-edge"
cask "raycast"
cask "sf-symbols"
cask "skim"
cask "stats"
cask "termius"
cask "textmate"
cask "typora"
cask "visual-studio-code"
cask "wireshark"
